

============================================================
1. COMMANDES ECHO
============================================================

Test 1: echo simple
Commande: echo Bonjour
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:01.490280456 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:01.490280456 +0100
@@ -1 +1,3 @@
+minishell> echo Bonjour
 Bonjour
+minishell> exit
Bash stdout:
Bonjour

Minishell stdout:
minishell> echo Bonjour
Bonjour
minishell> exit

Bash stderr:

Minishell stderr:

-------------------------------------------------------------

Test 2: echo avec plusieurs arguments
Commande: echo Bonjour le monde
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:01.582281968 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:01.582281968 +0100
@@ -1 +1,3 @@
+minishell> echo Bonjour le monde
 Bonjour le monde
+minishell> exit
Bash stdout:
Bonjour le monde

Minishell stdout:
minishell> echo Bonjour le monde
Bonjour le monde
minishell> exit

Bash stderr:

Minishell stderr:

-------------------------------------------------------------

Test 3: echo avec option -n
Commande: echo -n Bonjour
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:01.666283350 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:01.666283350 +0100
@@ -1 +1,2 @@
-Bonjour
\ No newline at end of file
+minishell> echo -n Bonjour
+Bonjourminishell> exit
Bash stdout:
Bonjour
Minishell stdout:
minishell> echo -n Bonjour
Bonjourminishell> exit

Bash stderr:

Minishell stderr:

-------------------------------------------------------------

Test 4: echo avec guillemets
Commande: echo "Bonjour le monde"
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:01.758284862 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:01.758284862 +0100
@@ -1 +1,3 @@
+minishell> echo "Bonjour le monde"
 Bonjour le monde
+minishell> exit
Bash stdout:
Bonjour le monde

Minishell stdout:
minishell> echo "Bonjour le monde"
Bonjour le monde
minishell> exit

Bash stderr:

Minishell stderr:

-------------------------------------------------------------

Test 5: echo avec apostrophes
Commande: echo 'Bonjour le monde'
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:01.850286376 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:01.850286376 +0100
@@ -1 +1,3 @@
+minishell> echo 'Bonjour le monde'
 Bonjour le monde
+minishell> exit
Bash stdout:
Bonjour le monde

Minishell stdout:
minishell> echo 'Bonjour le monde'
Bonjour le monde
minishell> exit

Bash stderr:

Minishell stderr:

-------------------------------------------------------------

Test 6: echo avec guillemets et variables
Commande: echo "HOME est $HOME"
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:01.946287954 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:01.950288020 +0100
@@ -1 +1,3 @@
+minishell> echo "HOME est $HOME"
 HOME est /home/yboumanz
+minishell> exit
Bash stdout:
HOME est /home/yboumanz

Minishell stdout:
minishell> echo "HOME est $HOME"
HOME est /home/yboumanz
minishell> exit

Bash stderr:

Minishell stderr:

-------------------------------------------------------------

Test 7: echo avec apostrophes et variables
Commande: echo 'HOME est $HOME'
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:02.042289533 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:02.046289599 +0100
@@ -1 +1,3 @@
+minishell> echo 'HOME est $HOME'
 HOME est $HOME
+minishell> exit
Bash stdout:
HOME est $HOME

Minishell stdout:
minishell> echo 'HOME est $HOME'
HOME est $HOME
minishell> exit

Bash stderr:

Minishell stderr:

-------------------------------------------------------------

Test 8: echo vide
Commande: echo
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:02.146291243 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:02.146291243 +0100
@@ -1 +1,3 @@
+minishell> echo
 
+minishell> exit
Bash stdout:


Minishell stdout:
minishell> echo

minishell> exit

Bash stderr:

Minishell stderr:

-------------------------------------------------------------

Test 9: echo avec espaces
Commande: echo '   Bonjour   ' | cat -e
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:02.238292756 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:02.242292822 +0100
@@ -1 +1,3 @@
+minishell> echo '   Bonjour   ' | cat -e
    Bonjour   $
+minishell> exit
Bash stdout:
   Bonjour   $

Minishell stdout:
minishell> echo '   Bonjour   ' | cat -e
   Bonjour   $
minishell> exit

Bash stderr:

Minishell stderr:

-------------------------------------------------------------

Test 10: echo avec tabulations
Commande: echo -e "Bonjour	monsieur" | cat -e
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:02.334294335 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:02.338294400 +0100
@@ -1 +1,3 @@
--e Bonjour	monsieur$
+minishell> echo -e "Bonjour\tmonsieur" | cat -e
+-e Bonjourtmonsieur$
+minishell> exit
Bash stdout:
-e Bonjour	monsieur$

Minishell stdout:
minishell> echo -e "Bonjour\tmonsieur" | cat -e
-e Bonjourtmonsieur$
minishell> exit

Bash stderr:

Minishell stderr:

-------------------------------------------------------------


============================================================
2. VARIABLES D'ENVIRONNEMENT
============================================================

Test 11: Afficher la variable HOME
Commande: echo $HOME
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:02.426295848 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:02.430295913 +0100
@@ -1 +1,3 @@
+minishell> echo $HOME
 /home/yboumanz
+minishell> exit
Bash stdout:
/home/yboumanz

Minishell stdout:
minishell> echo $HOME
/home/yboumanz
minishell> exit

Bash stderr:

Minishell stderr:

-------------------------------------------------------------

Test 12: Variable non définie
Commande: echo $VARIABLE_INEXISTANTE
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:02.514297294 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:02.518297361 +0100
@@ -1 +1,3 @@
+minishell> echo $VARIABLE_INEXISTANTE
 
+minishell> exit
Bash stdout:


Minishell stdout:
minishell> echo $VARIABLE_INEXISTANTE

minishell> exit

Bash stderr:

Minishell stderr:

-------------------------------------------------------------

Test 13: Variable avec paramètres supplémentaires
Commande: echo $HOME/documents
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:02.610298873 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:02.610298873 +0100
@@ -1 +1,3 @@
+minishell> echo $HOME/documents
 /home/yboumanz/documents
+minishell> exit
Bash stdout:
/home/yboumanz/documents

Minishell stdout:
minishell> echo $HOME/documents
/home/yboumanz/documents
minishell> exit

Bash stderr:

Minishell stderr:

-------------------------------------------------------------

Test 14: Variable avec échappement
Commande: echo \$HOME
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:02.698300321 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:02.702300386 +0100
@@ -1 +1,3 @@
+minishell> echo \$HOME
 $HOME
+minishell> exit
Bash stdout:
$HOME

Minishell stdout:
minishell> echo \$HOME
$HOME
minishell> exit

Bash stderr:

Minishell stderr:

-------------------------------------------------------------

Test 15: Variable dans guillemets doubles
Commande: echo "$HOME"
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:02.790301834 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:02.790301834 +0100
@@ -1 +1,3 @@
+minishell> echo "$HOME"
 /home/yboumanz
+minishell> exit
Bash stdout:
/home/yboumanz

Minishell stdout:
minishell> echo "$HOME"
/home/yboumanz
minishell> exit

Bash stderr:

Minishell stderr:

-------------------------------------------------------------

Test 16: Variable dans guillemets simples
Commande: echo '$HOME'
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:02.878303280 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:02.882303346 +0100
@@ -1 +1,3 @@
+minishell> echo '$HOME'
 $HOME
+minishell> exit
Bash stdout:
$HOME

Minishell stdout:
minishell> echo '$HOME'
$HOME
minishell> exit

Bash stderr:

Minishell stderr:

-------------------------------------------------------------

Test 17: Exporter une variable
Commande: export HELLO=world && echo $HELLO
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:02.974304859 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:02.978304925 +0100
@@ -1 +1,2 @@
-world
+minishell> export HELLO=world && echo $HELLO
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:02.966304728 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:02.978304925 +0100
@@ -0,0 +1 @@
+minishell: syntax error near unexpected token `&&'
Bash stdout:
world

Minishell stdout:
minishell> export HELLO=world && echo $HELLO
minishell> exit

Bash stderr:

Minishell stderr:
minishell: syntax error near unexpected token `&&'

-------------------------------------------------------------

Test 18: Supprimer une variable
Commande: export HELLO=world && unset HELLO && echo $HELLO
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:03.078306569 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:03.078306569 +0100
@@ -1 +1,2 @@
-
+minishell> export HELLO=world && unset HELLO && echo $HELLO
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:03.074306504 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:03.078306569 +0100
@@ -0,0 +1 @@
+minishell: syntax error near unexpected token `&&'
Bash stdout:


Minishell stdout:
minishell> export HELLO=world && unset HELLO && echo $HELLO
minishell> exit

Bash stderr:

Minishell stderr:
minishell: syntax error near unexpected token `&&'

-------------------------------------------------------------


============================================================
3. REDIRECTIONS
============================================================

Test 19: Redirection de sortie simple
Commande: echo Bonjour > test_out.txt && cat test_out.txt && rm test_out.txt
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:03.170308082 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:03.170308082 +0100
@@ -1 +1,2 @@
-Bonjour
+minishell> echo Bonjour > test_out.txt && cat test_out.txt && rm test_out.txt
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:03.162307951 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:03.170308082 +0100
@@ -0,0 +1 @@
+minishell: syntax error near unexpected token `&&'
Bash stdout:
Bonjour

Minishell stdout:
minishell> echo Bonjour > test_out.txt && cat test_out.txt && rm test_out.txt
minishell> exit

Bash stderr:

Minishell stderr:
minishell: syntax error near unexpected token `&&'

-------------------------------------------------------------

Test 20: Redirection de sortie avec append
Commande: echo Ligne 1 > test_out.txt && echo Ligne 2 >> test_out.txt && cat test_out.txt && rm test_out.txt
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:03.258309530 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:03.262309595 +0100
@@ -1,2 +1,2 @@
-Ligne 1
-Ligne 2
+minishell> echo Ligne 1 > test_out.txt && echo Ligne 2 >> test_out.txt && cat test_out.txt && rm test_out.txt
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:03.254309463 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:03.262309595 +0100
@@ -0,0 +1 @@
+minishell: syntax error near unexpected token `&&'
Bash stdout:
Ligne 1
Ligne 2

Minishell stdout:
minishell> echo Ligne 1 > test_out.txt && echo Ligne 2 >> test_out.txt && cat test_out.txt && rm test_out.txt
minishell> exit

Bash stderr:

Minishell stderr:
minishell: syntax error near unexpected token `&&'

-------------------------------------------------------------

Test 21: Redirection d'entrée
Commande: echo Bonjour > test_in.txt && cat < test_in.txt && rm test_in.txt
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:03.350311042 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:03.354311108 +0100
@@ -1 +1,2 @@
-Bonjour
+minishell> echo Bonjour > test_in.txt && cat < test_in.txt && rm test_in.txt
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:03.346310976 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:03.354311108 +0100
@@ -0,0 +1 @@
+minishell: syntax error near unexpected token `&&'
Bash stdout:
Bonjour

Minishell stdout:
minishell> echo Bonjour > test_in.txt && cat < test_in.txt && rm test_in.txt
minishell> exit

Bash stderr:

Minishell stderr:
minishell: syntax error near unexpected token `&&'

-------------------------------------------------------------

Test 22: Redirection d'entrée et sortie
Commande: echo Bonjour > test_in.txt && cat < test_in.txt > test_out.txt && cat test_out.txt && rm test_in.txt test_out.txt
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:03.442312555 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:03.446312621 +0100
@@ -1 +1,2 @@
-Bonjour
+minishell> echo Bonjour > test_in.txt && cat < test_in.txt > test_out.txt && cat test_out.txt && rm test_in.txt test_out.txt
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:03.434312424 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:03.446312621 +0100
@@ -0,0 +1 @@
+minishell: syntax error near unexpected token `&&'
Bash stdout:
Bonjour

Minishell stdout:
minishell> echo Bonjour > test_in.txt && cat < test_in.txt > test_out.txt && cat test_out.txt && rm test_in.txt test_out.txt
minishell> exit

Bash stderr:

Minishell stderr:
minishell: syntax error near unexpected token `&&'

-------------------------------------------------------------

Test 23: Heredoc simple
Commande: cat << EOF
Bonjour
Le Monde
EOF
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:03.522313871 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:03.530314002 +0100
@@ -0,0 +1,2 @@
+minishell> cat << EOF\nBonjour\nLe Monde\nEOF
+> minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:03.526313936 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:03.530314002 +0100
@@ -1 +0,0 @@
-cat: MondenEOF: No such file or directory
Bash stdout:

Minishell stdout:
minishell> cat << EOF\nBonjour\nLe Monde\nEOF
> minishell> exit

Bash stderr:
cat: MondenEOF: No such file or directory

Minishell stderr:

-------------------------------------------------------------

Test 24: Heredoc avec variable
Commande: cat << EOF
Mon Home: $HOME
EOF
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:03.610315318 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:03.618315449 +0100
@@ -0,0 +1,2 @@
+minishell> cat << EOF\nMon Home: $HOME\nEOF
+> minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:03.614315384 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:03.614315384 +0100
@@ -1,2 +0,0 @@
-cat: 'Home:': No such file or directory
-cat: /home/yboumanznEOF: No such file or directory
Bash stdout:

Minishell stdout:
minishell> cat << EOF\nMon Home: $HOME\nEOF
> minishell> exit

Bash stderr:
cat: 'Home:': No such file or directory
cat: /home/yboumanznEOF: No such file or directory

Minishell stderr:

-------------------------------------------------------------

Test 25: Heredoc avec guillemets
Commande: cat << 'EOF'
Mon Home: $HOME
EOF
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:03.694316699 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:03.706316897 +0100
@@ -0,0 +1,2 @@
+minishell> cat << 'EOF'\nMon Home: $HOME\nEOF
+> minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:03.702316830 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:03.702316830 +0100
@@ -1,2 +0,0 @@
-cat: 'Home:': No such file or directory
-cat: /home/yboumanznEOF: No such file or directory
Bash stdout:

Minishell stdout:
minishell> cat << 'EOF'\nMon Home: $HOME\nEOF
> minishell> exit

Bash stderr:
cat: 'Home:': No such file or directory
cat: /home/yboumanznEOF: No such file or directory

Minishell stderr:

-------------------------------------------------------------


============================================================
4. PIPES
============================================================

Test 26: Pipe simple
Commande: echo Bonjour | cat
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:03.786318212 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:03.790318278 +0100
@@ -1 +1,3 @@
+minishell> echo Bonjour | cat
 Bonjour
+minishell> exit
Bash stdout:
Bonjour

Minishell stdout:
minishell> echo Bonjour | cat
Bonjour
minishell> exit

Bash stderr:

Minishell stderr:

-------------------------------------------------------------

Test 27: Pipe multiple
Commande: echo Bonjour | cat | cat | cat
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:03.874319659 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:03.882319791 +0100
@@ -1 +1,3 @@
+minishell> echo Bonjour | cat | cat | cat
 Bonjour
+minishell> exit
Bash stdout:
Bonjour

Minishell stdout:
minishell> echo Bonjour | cat | cat | cat
Bonjour
minishell> exit

Bash stderr:

Minishell stderr:

-------------------------------------------------------------

Test 28: Pipe avec grep
Commande: echo 'Ligne 1
Ligne 2
Ligne 3' | grep '2'
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:03.966321172 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:03.970321238 +0100
@@ -1 +1,3 @@
-Ligne 2
+minishell> echo 'Ligne 1\nLigne 2\nLigne 3' | grep '2'
+Ligne 1nLigne 2nLigne 3
+minishell> exit
Bash stdout:
Ligne 2

Minishell stdout:
minishell> echo 'Ligne 1\nLigne 2\nLigne 3' | grep '2'
Ligne 1nLigne 2nLigne 3
minishell> exit

Bash stderr:

Minishell stderr:

-------------------------------------------------------------

Test 29: Pipe avec wc
Commande: echo 'Ligne 1
Ligne 2
Ligne 3' | wc -l
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:04.050322553 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:04.054322619 +0100
@@ -1 +1,3 @@
-3
+minishell> echo 'Ligne 1\nLigne 2\nLigne 3' | wc -l
+1
+minishell> exit
Bash stdout:
3

Minishell stdout:
minishell> echo 'Ligne 1\nLigne 2\nLigne 3' | wc -l
1
minishell> exit

Bash stderr:

Minishell stderr:

-------------------------------------------------------------

Test 30: Pipe avec redirection
Commande: echo Bonjour | cat > test_out.txt && cat test_out.txt && rm test_out.txt
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:04.138324000 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:04.142324066 +0100
@@ -1 +1,2 @@
-Bonjour
+minishell> echo Bonjour | cat > test_out.txt && cat test_out.txt && rm test_out.txt
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:04.130323869 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:04.142324066 +0100
@@ -0,0 +1 @@
+minishell: syntax error near unexpected token `&&'
Bash stdout:
Bonjour

Minishell stdout:
minishell> echo Bonjour | cat > test_out.txt && cat test_out.txt && rm test_out.txt
minishell> exit

Bash stderr:

Minishell stderr:
minishell: syntax error near unexpected token `&&'

-------------------------------------------------------------


============================================================
5. COMMANDES INTÉGRÉES
============================================================

Test 31: CD simple
Commande: cd / && pwd
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:04.222325381 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:04.222325381 +0100
@@ -1 +1,2 @@
-/
+minishell> cd / && pwd
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:04.218325316 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:04.222325381 +0100
@@ -0,0 +1 @@
+minishell: syntax error near unexpected token `&&'
Bash stdout:
/

Minishell stdout:
minishell> cd / && pwd
minishell> exit

Bash stderr:

Minishell stderr:
minishell: syntax error near unexpected token `&&'

-------------------------------------------------------------

Test 32: CD avec chemin relatif
Commande: cd .. && pwd && cd - > /dev/null
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:04.306326763 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:04.310326829 +0100
@@ -1 +1,2 @@
-/home/yboumanz
+minishell> cd .. && pwd && cd - > /dev/null
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:04.302326697 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:04.310326829 +0100
@@ -0,0 +1 @@
+minishell: syntax error near unexpected token `&&'
Bash stdout:
/home/yboumanz

Minishell stdout:
minishell> cd .. && pwd && cd - > /dev/null
minishell> exit

Bash stderr:

Minishell stderr:
minishell: syntax error near unexpected token `&&'

-------------------------------------------------------------

Test 33: PWD
Commande: pwd
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:04.390328144 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:04.390328144 +0100
@@ -1 +1,3 @@
+minishell> pwd
 /home/yboumanz/minishell
+minishell> exit
Bash stdout:
/home/yboumanz/minishell

Minishell stdout:
minishell> pwd
/home/yboumanz/minishell
minishell> exit

Bash stderr:

Minishell stderr:

-------------------------------------------------------------

Test 34: Export sans argument
Commande: export | grep -E '^declare -x (HOME|USER)='
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:04.470329460 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:04.478329592 +0100
@@ -0,0 +1,4 @@
+minishell> export | grep -E '^declare -x (HOME|USER)='
+declare -x HOME="/home/yboumanz"
+declare -x USER="yboumanz"
+minishell> exit
Bash stdout:

Minishell stdout:
minishell> export | grep -E '^declare -x (HOME|USER)='
declare -x HOME="/home/yboumanz"
declare -x USER="yboumanz"
minishell> exit

Bash stderr:

Minishell stderr:

-------------------------------------------------------------

Test 35: Export avec assignation
Commande: export TEST=value && echo $TEST
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:04.558330907 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:04.562330973 +0100
@@ -1 +1,2 @@
-value
+minishell> export TEST=value && echo $TEST
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:04.554330841 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:04.562330973 +0100
@@ -0,0 +1 @@
+minishell: syntax error near unexpected token `&&'
Bash stdout:
value

Minishell stdout:
minishell> export TEST=value && echo $TEST
minishell> exit

Bash stderr:

Minishell stderr:
minishell: syntax error near unexpected token `&&'

-------------------------------------------------------------

Test 36: Unset
Commande: export TEST=value && unset TEST && echo $TEST
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:04.646332354 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:04.650332420 +0100
@@ -1 +1,2 @@
-
+minishell> export TEST=value && unset TEST && echo $TEST
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:04.642332288 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:04.650332420 +0100
@@ -0,0 +1 @@
+minishell: syntax error near unexpected token `&&'
Bash stdout:


Minishell stdout:
minishell> export TEST=value && unset TEST && echo $TEST
minishell> exit

Bash stderr:

Minishell stderr:
minishell: syntax error near unexpected token `&&'

-------------------------------------------------------------

Test 37: Exit avec code
Commande: exit 42
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:04.734333801 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:04.738333867 +0100
@@ -0,0 +1 @@
+minishell> exit 42
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:04.734333801 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:04.738333867 +0100
@@ -0,0 +1 @@
+exit
Bash stdout:

Minishell stdout:
minishell> exit 42

Bash stderr:

Minishell stderr:
exit

-------------------------------------------------------------

Test 38: Exit sans argument
Commande: echo 'Testing exit code' && exit
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:04.826335314 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:04.826335314 +0100
@@ -1 +1,2 @@
-Testing exit code
+minishell> echo 'Testing exit code' && exit
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:04.822335248 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:04.826335314 +0100
@@ -0,0 +1 @@
+minishell: syntax error near unexpected token `&&'
Bash stdout:
Testing exit code

Minishell stdout:
minishell> echo 'Testing exit code' && exit
minishell> exit

Bash stderr:

Minishell stderr:
minishell: syntax error near unexpected token `&&'

-------------------------------------------------------------


============================================================
6. TESTS DE SYNTAXE
============================================================

Test 39: Guillemets non fermés
Commande: echo "Bonjour
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:04.910336696 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:04.918336827 +0100
@@ -0,0 +1,2 @@
+minishell> echo "Bonjour
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:04.918336827 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:04.918336827 +0100
@@ -1 +1 @@
-test_results/bash_command.sh: 2: Syntax error: Unterminated quoted string
+Syntax error: missing closing quote "
Bash stdout:

Minishell stdout:
minishell> echo "Bonjour
minishell> exit

Bash stderr:
test_results/bash_command.sh: 2: Syntax error: Unterminated quoted string

Minishell stderr:
Syntax error: missing closing quote "

-------------------------------------------------------------

Test 40: Pipe vide
Commande: ls 
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:05.010338340 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:05.014338406 +0100
@@ -1,3 +1,4 @@
+minishell> ls 
 analyze_minishell.sh
 CHANGELOG.md
 generate_tests.py
@@ -19,3 +20,4 @@
 tests
 tests_additionnels.txt
 valgrind_supp
+minishell> exit
Bash stdout:
analyze_minishell.sh
CHANGELOG.md
generate_tests.py
includes
leak_analyzer.sh
libft
Makefile
minishell
minishell_tester
output_analyzer.sh
README_TESTS.md
srcs
test_heredoc_redirect.sh
test_heredoc.sh
test_heredoc_simple.sh
test_minishell.sh
test_perm.txt
test_results
tests
tests_additionnels.txt
valgrind_supp

Minishell stdout:
minishell> ls 
analyze_minishell.sh
CHANGELOG.md
generate_tests.py
includes
leak_analyzer.sh
libft
Makefile
minishell
minishell_tester
output_analyzer.sh
README_TESTS.md
srcs
test_heredoc_redirect.sh
test_heredoc.sh
test_heredoc_simple.sh
test_minishell.sh
test_perm.txt
test_results
tests
tests_additionnels.txt
valgrind_supp
minishell> exit

Bash stderr:

Minishell stderr:

-------------------------------------------------------------

Test 41: Double pipe
Commande: ls ||
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:05.090339655 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:05.094339721 +0100
@@ -0,0 +1,2 @@
+minishell> ls ||
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:05.094339721 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:05.094339721 +0100
@@ -1 +1 @@
-test_results/bash_command.sh: 2: Syntax error: end of file unexpected
+minishell: syntax error near unexpected token `|'
Bash stdout:

Minishell stdout:
minishell> ls ||
minishell> exit

Bash stderr:
test_results/bash_command.sh: 2: Syntax error: end of file unexpected

Minishell stderr:
minishell: syntax error near unexpected token `|'

-------------------------------------------------------------

Test 42: Commande non trouvée
Commande: commandeinexistante
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:05.174341036 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:05.182341168 +0100
@@ -0,0 +1,2 @@
+minishell> commandeinexistante
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:05.178341103 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:05.182341168 +0100
@@ -1 +1 @@
-test_results/bash_command.sh: 1: commandeinexistante: not found
+minishell: commandeinexistante: command not found
Bash stdout:

Minishell stdout:
minishell> commandeinexistante
minishell> exit

Bash stderr:
test_results/bash_command.sh: 1: commandeinexistante: not found

Minishell stderr:
minishell: commandeinexistante: command not found

-------------------------------------------------------------

Test 43: Redirection vers fichier inexistant
Commande: cat < fichierinexistant
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:05.262342484 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:05.270342615 +0100
@@ -0,0 +1,2 @@
+minishell> cat < fichierinexistant
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:05.266342550 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:05.270342615 +0100
@@ -1 +1 @@
-test_results/bash_command.sh: 1: cannot open fichierinexistant: No such file
+minishell: fichierinexistant: No such file or directory
Bash stdout:

Minishell stdout:
minishell> cat < fichierinexistant
minishell> exit

Bash stderr:
test_results/bash_command.sh: 1: cannot open fichierinexistant: No such file

Minishell stderr:
minishell: fichierinexistant: No such file or directory

-------------------------------------------------------------

Test 44: Permission refusée
Commande: chmod 000 test_perm.txt && cat test_perm.txt && chmod 644 test_perm.txt && rm test_perm.txt
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:05.350343931 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:05.358344063 +0100
@@ -0,0 +1,2 @@
+minishell> chmod 000 test_perm.txt && cat test_perm.txt && chmod 644 test_perm.txt && rm test_perm.txt
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:05.354343997 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:05.358344063 +0100
@@ -1 +1 @@
-cat: test_perm.txt: Permission denied
+minishell: syntax error near unexpected token `&&'
Bash stdout:

Minishell stdout:
minishell> chmod 000 test_perm.txt && cat test_perm.txt && chmod 644 test_perm.txt && rm test_perm.txt
minishell> exit

Bash stderr:
cat: test_perm.txt: Permission denied

Minishell stderr:
minishell: syntax error near unexpected token `&&'

-------------------------------------------------------------


============================================================
7. CARACTÈRES SPÉCIAUX
============================================================

Test 45: Guillemets dans guillemets
Commande: echo "L'exemple 'cité'"
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:05.438345378 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:05.438345378 +0100
@@ -1 +1,3 @@
+minishell> echo "L'exemple 'cité'"
 L'exemple 'cité'
+minishell> exit
Bash stdout:
L'exemple 'cité'

Minishell stdout:
minishell> echo "L'exemple 'cité'"
L'exemple 'cité'
minishell> exit

Bash stderr:

Minishell stderr:

-------------------------------------------------------------

Test 46: Apostrophes dans guillemets
Commande: echo 'L"exemple "cité"'
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:05.522346760 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:05.526346826 +0100
@@ -1 +1,3 @@
+minishell> echo 'L"exemple "cité"'
 L"exemple "cité"
+minishell> exit
Bash stdout:
L"exemple "cité"

Minishell stdout:
minishell> echo 'L"exemple "cité"'
L"exemple "cité"
minishell> exit

Bash stderr:

Minishell stderr:

-------------------------------------------------------------

Test 47: Caractère d'échappement
Commande: echo Bonjour
Monde
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:05.606348141 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:05.610348207 +0100
@@ -1 +1,3 @@
+minishell> echo Bonjour\nMonde
 BonjournMonde
+minishell> exit
Bash stdout:
BonjournMonde

Minishell stdout:
minishell> echo Bonjour\nMonde
BonjournMonde
minishell> exit

Bash stderr:

Minishell stderr:

-------------------------------------------------------------

Test 48: Astérisque avec wildcard
Commande: echo *
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:05.698349654 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:05.698349654 +0100
@@ -1 +1,3 @@
-CHANGELOG.md Makefile README_TESTS.md analyze_minishell.sh generate_tests.py includes leak_analyzer.sh libft minishell minishell_tester output_analyzer.sh srcs test_heredoc.sh test_heredoc_redirect.sh test_heredoc_simple.sh test_minishell.sh test_perm.txt test_results tests tests_additionnels.txt valgrind_supp
+minishell> echo *
+*
+minishell> exit
Bash stdout:
CHANGELOG.md Makefile README_TESTS.md analyze_minishell.sh generate_tests.py includes leak_analyzer.sh libft minishell minishell_tester output_analyzer.sh srcs test_heredoc.sh test_heredoc_redirect.sh test_heredoc_simple.sh test_minishell.sh test_perm.txt test_results tests tests_additionnels.txt valgrind_supp

Minishell stdout:
minishell> echo *
*
minishell> exit

Bash stderr:

Minishell stderr:

-------------------------------------------------------------

Test 49: Question avec wildcard
Commande: echo *.?
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:05.782351035 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:05.782351035 +0100
@@ -1 +1,3 @@
+minishell> echo *.?
 *.?
+minishell> exit
Bash stdout:
*.?

Minishell stdout:
minishell> echo *.?
*.?
minishell> exit

Bash stderr:

Minishell stderr:

-------------------------------------------------------------

Test 50: Caractère $
Commande: echo $
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:05.866352416 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:05.870352483 +0100
@@ -1 +1,3 @@
+minishell> echo $
 $
+minishell> exit
Bash stdout:
$

Minishell stdout:
minishell> echo $
$
minishell> exit

Bash stderr:

Minishell stderr:

-------------------------------------------------------------

Test 51: Caractère ?
Commande: echo ?
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:05.954353864 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:05.954353864 +0100
@@ -1 +1,3 @@
+minishell> echo ?
 ?
+minishell> exit
Bash stdout:
?

Minishell stdout:
minishell> echo ?
?
minishell> exit

Bash stderr:

Minishell stderr:

-------------------------------------------------------------


============================================================
8. TESTS COMPLEXES
============================================================

Test 52: Commande multiple avec pipes
Commande: ls -la | grep "." | sort | head -n 5
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:06.042355310 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:06.050355442 +0100
@@ -1,5 +1,7 @@
+minishell> ls -la | grep "." | sort | head -n 5
 ----------  1 yboumanz 2024_paris     0 Mar 14 10:23 test_perm.txt
 drwx------ 32 yboumanz 2024_paris  4096 Mar 14 10:22 ..
 drwxr-xr-x 11 yboumanz 2024_paris  4096 Mar 14 10:23 .
 drwxr-xr-x  2 yboumanz 2024_paris   165 Mar 13 04:09 tests
 drwxr-xr-x  2 yboumanz 2024_paris    22 Mar 14 07:04 includes
+minishell> exit
Bash stdout:
----------  1 yboumanz 2024_paris     0 Mar 14 10:23 test_perm.txt
drwx------ 32 yboumanz 2024_paris  4096 Mar 14 10:22 ..
drwxr-xr-x 11 yboumanz 2024_paris  4096 Mar 14 10:23 .
drwxr-xr-x  2 yboumanz 2024_paris   165 Mar 13 04:09 tests
drwxr-xr-x  2 yboumanz 2024_paris    22 Mar 14 07:04 includes

Minishell stdout:
minishell> ls -la | grep "." | sort | head -n 5
----------  1 yboumanz 2024_paris     0 Mar 14 10:23 test_perm.txt
drwx------ 32 yboumanz 2024_paris  4096 Mar 14 10:22 ..
drwxr-xr-x 11 yboumanz 2024_paris  4096 Mar 14 10:23 .
drwxr-xr-x  2 yboumanz 2024_paris   165 Mar 13 04:09 tests
drwxr-xr-x  2 yboumanz 2024_paris    22 Mar 14 07:04 includes
minishell> exit

Bash stderr:

Minishell stderr:

-------------------------------------------------------------

Test 53: Redirection multiple
Commande: echo Ligne1 > test1.txt && echo Ligne2 > test2.txt && cat test1.txt test2.txt > test3.txt && cat test3.txt && rm test1.txt test2.txt test3.txt
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:06.138356889 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:06.142356955 +0100
@@ -1,2 +1,2 @@
-Ligne1
-Ligne2
+minishell> echo Ligne1 > test1.txt && echo Ligne2 > test2.txt && cat test1.txt test2.txt > test3.txt && cat test3.txt && rm test1.txt test2.txt test3.txt
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:06.130356758 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:06.142356955 +0100
@@ -0,0 +1 @@
+minishell: syntax error near unexpected token `&&'
Bash stdout:
Ligne1
Ligne2

Minishell stdout:
minishell> echo Ligne1 > test1.txt && echo Ligne2 > test2.txt && cat test1.txt test2.txt > test3.txt && cat test3.txt && rm test1.txt test2.txt test3.txt
minishell> exit

Bash stderr:

Minishell stderr:
minishell: syntax error near unexpected token `&&'

-------------------------------------------------------------

Test 54: Utilisation PATH relatif
Commande: ./minishell -c "echo Bonjour"
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:06.230358402 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:06.238358534 +0100
@@ -0,0 +1,2 @@
+minishell> ./minishell -c "echo Bonjour"
+minishell> exit
Bash stdout:

Minishell stdout:
minishell> ./minishell -c "echo Bonjour"
minishell> exit

Bash stderr:
Usage: ./minishell

Minishell stderr:
Usage: ./minishell

-------------------------------------------------------------

Test 55: Commande avec options multiples
Commande: ls -la -R / | head -n 10
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:06.330360046 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:06.334360113 +0100
@@ -1,3 +1,4 @@
+minishell> ls -la -R / | head -n 10
 /:
 total 4194457
 drwxr-xr-x  23 root root       4096 Jul  9  2024 .
@@ -8,3 +9,4 @@
 drwxrwxrwt   2 root root       4096 Mar 27  2024 cdrom
 drwxr-xr-x  24 root root       4820 Mar 14 06:57 dev
 -rw-r--r--   1 root root          0 Mar 27  2024 .dumped
+minishell> exit
Bash stdout:
/:
total 4194457
drwxr-xr-x  23 root root       4096 Jul  9  2024 .
drwxr-xr-x  23 root root       4096 Jul  9  2024 ..
lrwxrwxrwx   1 root root          7 Feb 16  2024 bin -> usr/bin
drwxr-xr-x   5 root root       4096 Mar  8 06:47 boot
drwx------   2 root root       4096 Mar 29  2024 .cache
drwxrwxrwt   2 root root       4096 Mar 27  2024 cdrom
drwxr-xr-x  24 root root       4820 Mar 14 06:57 dev
-rw-r--r--   1 root root          0 Mar 27  2024 .dumped

Minishell stdout:
minishell> ls -la -R / | head -n 10
/:
total 4194457
drwxr-xr-x  23 root root       4096 Jul  9  2024 .
drwxr-xr-x  23 root root       4096 Jul  9  2024 ..
lrwxrwxrwx   1 root root          7 Feb 16  2024 bin -> usr/bin
drwxr-xr-x   5 root root       4096 Mar  8 06:47 boot
drwx------   2 root root       4096 Mar 29  2024 .cache
drwxrwxrwt   2 root root       4096 Mar 27  2024 cdrom
drwxr-xr-x  24 root root       4820 Mar 14 06:57 dev
-rw-r--r--   1 root root          0 Mar 27  2024 .dumped
minishell> exit

Bash stderr:

Minishell stderr:

-------------------------------------------------------------

Test 56: Export avec valeur complexe
Commande: export COMPLEX="ceci est une 'valeur' \"complexe\"" && echo $COMPLEX
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:06.422361560 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:06.422361560 +0100
@@ -1 +1,2 @@
-ceci est une 'valeur' "complexe"
+minishell> export COMPLEX="ceci est une 'valeur' \"complexe\"" && echo $COMPLEX
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:06.418361494 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:06.422361560 +0100
@@ -0,0 +1 @@
+minishell: syntax error near unexpected token `&&'
Bash stdout:
ceci est une 'valeur' "complexe"

Minishell stdout:
minishell> export COMPLEX="ceci est une 'valeur' \"complexe\"" && echo $COMPLEX
minishell> exit

Bash stderr:

Minishell stderr:
minishell: syntax error near unexpected token `&&'

-------------------------------------------------------------


============================================================
9. TESTS ADDITIONNELS (À PARTIR DE FICHIER)
============================================================

Test 57: 
 (touche entrée)
Commande: 
 (touche entrée)
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:06.510363007 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:06.518363138 +0100
@@ -0,0 +1,2 @@
+minishell> \n (touche entrée)
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:06.514363073 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:06.518363138 +0100
@@ -1 +1 @@
-test_results/bash_command.sh: 1: Syntax error: word unexpected (expecting ")")
+minishell: n: command not found
Bash stdout:

Minishell stdout:
minishell> \n (touche entrée)
minishell> exit

Bash stderr:
test_results/bash_command.sh: 1: Syntax error: word unexpected (expecting ")")

Minishell stderr:
minishell: n: command not found

-------------------------------------------------------------

Test 58: [que des tabulations]
Commande: [que des tabulations]
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:06.642365178 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:06.654365375 +0100
@@ -0,0 +1,2 @@
+minishell> [que des tabulations]
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:06.650365309 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:06.654365375 +0100
@@ -1 +1 @@
-test_results/bash_command.sh: 1: [que: not found
+minishell: [que: command not found
Bash stdout:

Minishell stdout:
minishell> [que des tabulations]
minishell> exit

Bash stderr:
test_results/bash_command.sh: 1: [que: not found

Minishell stderr:
minishell: [que: command not found

-------------------------------------------------------------

Test 59: :
Commande: :
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:06.774367348 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:06.782367480 +0100
@@ -0,0 +1,2 @@
+minishell> :
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:06.774367348 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:06.778367414 +0100
@@ -0,0 +1 @@
+minishell: :: command not found
Bash stdout:

Minishell stdout:
minishell> :
minishell> exit

Bash stderr:

Minishell stderr:
minishell: :: command not found

-------------------------------------------------------------

Test 60: !
Commande: !
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:06.870368927 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:06.878369059 +0100
@@ -0,0 +1,2 @@
+minishell> !
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:06.874368993 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:06.878369059 +0100
@@ -1 +1 @@
-test_results/bash_command.sh: 2: Syntax error: newline unexpected
+minishell: !: command not found
Bash stdout:

Minishell stdout:
minishell> !
minishell> exit

Bash stderr:
test_results/bash_command.sh: 2: Syntax error: newline unexpected

Minishell stderr:
minishell: !: command not found

-------------------------------------------------------------

Test 61: >
Commande: >
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:06.962370440 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:06.970370572 +0100
@@ -0,0 +1,2 @@
+minishell> >
+minishll: minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:06.966370505 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:06.970370572 +0100
@@ -1 +1 @@
-test_results/bash_command.sh: 2: Syntax error: newline unexpected
+syntax error near unexpected token `newline'
Bash stdout:

Minishell stdout:
minishell> >
minishll: minishell> exit

Bash stderr:
test_results/bash_command.sh: 2: Syntax error: newline unexpected

Minishell stderr:
syntax error near unexpected token `newline'

-------------------------------------------------------------

Test 62: <
Commande: <
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:07.054371953 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:07.062372084 +0100
@@ -0,0 +1,2 @@
+minishell> <
+minishll: minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:07.062372084 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:07.062372084 +0100
@@ -1 +1 @@
-test_results/bash_command.sh: 2: Syntax error: newline unexpected
+syntax error near unexpected token `newline'
Bash stdout:

Minishell stdout:
minishell> <
minishll: minishell> exit

Bash stderr:
test_results/bash_command.sh: 2: Syntax error: newline unexpected

Minishell stderr:
syntax error near unexpected token `newline'

-------------------------------------------------------------

Test 63: > >
Commande: > >
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:07.150373531 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:07.154373597 +0100
@@ -0,0 +1,2 @@
+minishell> > >
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:07.154373597 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:07.154373597 +0100
@@ -1 +1 @@
-test_results/bash_command.sh: 1: Syntax error: redirection unexpected
+minishell: syntax error near unexpected token `newline'
Bash stdout:

Minishell stdout:
minishell> > >
minishell> exit

Bash stderr:
test_results/bash_command.sh: 1: Syntax error: redirection unexpected

Minishell stderr:
minishell: syntax error near unexpected token `newline'

-------------------------------------------------------------

Test 64: < <
Commande: < <
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:07.238374979 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:07.246375110 +0100
@@ -0,0 +1,2 @@
+minishell> < <
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:07.242375044 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:07.246375110 +0100
@@ -1 +1 @@
-test_results/bash_command.sh: 1: Syntax error: redirection unexpected
+minishell: syntax error near unexpected token `newline'
Bash stdout:

Minishell stdout:
minishell> < <
minishell> exit

Bash stderr:
test_results/bash_command.sh: 1: Syntax error: redirection unexpected

Minishell stderr:
minishell: syntax error near unexpected token `newline'

-------------------------------------------------------------

Test 65: <>
Commande: <>
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:07.330376491 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:07.334376557 +0100
@@ -0,0 +1,2 @@
+minishell> <>
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:07.334376557 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:07.334376557 +0100
@@ -1 +1 @@
-test_results/bash_command.sh: 2: Syntax error: newline unexpected
+minishell: syntax error near unexpected token `newline'
Bash stdout:

Minishell stdout:
minishell> <>
minishell> exit

Bash stderr:
test_results/bash_command.sh: 2: Syntax error: newline unexpected

Minishell stderr:
minishell: syntax error near unexpected token `newline'

-------------------------------------------------------------

Test 66: > >> >>
Commande: > >> >>
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:07.418377939 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:07.422378004 +0100
@@ -0,0 +1,2 @@
+minishell> > >> >>
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:07.422378004 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:07.422378004 +0100
@@ -1 +1 @@
-test_results/bash_command.sh: 1: Syntax error: redirection unexpected
+minishell: syntax error near unexpected token `newline'
Bash stdout:

Minishell stdout:
minishell> > >> >>
minishell> exit

Bash stderr:
test_results/bash_command.sh: 1: Syntax error: redirection unexpected

Minishell stderr:
minishell: syntax error near unexpected token `newline'

-------------------------------------------------------------

Test 67: > >> >> >> >> >> >> >>
Commande: > >> >> >> >> >> >> >>
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:07.506379385 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:07.514379517 +0100
@@ -0,0 +1,2 @@
+minishell> > >> >> >> >> >> >> >>
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:07.510379452 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:07.514379517 +0100
@@ -1 +1 @@
-test_results/bash_command.sh: 1: Syntax error: redirection unexpected
+minishell: syntax error near unexpected token `newline'
Bash stdout:

Minishell stdout:
minishell> > >> >> >> >> >> >> >>
minishell> exit

Bash stderr:
test_results/bash_command.sh: 1: Syntax error: redirection unexpected

Minishell stderr:
minishell: syntax error near unexpected token `newline'

-------------------------------------------------------------

Test 68: < << <<
Commande: < << <<
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:07.594380833 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:07.598380898 +0100
@@ -0,0 +1,2 @@
+minishell> < << <<
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:07.598380898 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:07.598380898 +0100
@@ -1 +1 @@
-test_results/bash_command.sh: 1: Syntax error: redirection unexpected
+minishell: syntax error near unexpected token `newline'
Bash stdout:

Minishell stdout:
minishell> < << <<
minishell> exit

Bash stderr:
test_results/bash_command.sh: 1: Syntax error: redirection unexpected

Minishell stderr:
minishell: syntax error near unexpected token `newline'

-------------------------------------------------------------

Test 69: < << << << << << << << <
Commande: < << << << << << << << <
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:07.682382280 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:07.686382346 +0100
@@ -0,0 +1,2 @@
+minishell> < << << << << << << << <
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:07.686382346 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:07.686382346 +0100
@@ -1 +1 @@
-test_results/bash_command.sh: 1: Syntax error: redirection unexpected
+minishell: syntax error near unexpected token `newline'
Bash stdout:

Minishell stdout:
minishell> < << << << << << << << <
minishell> exit

Bash stderr:
test_results/bash_command.sh: 1: Syntax error: redirection unexpected

Minishell stderr:
minishell: syntax error near unexpected token `newline'

-------------------------------------------------------------

Test 70: > > > >
Commande: > > > >
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:07.766383661 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:07.774383792 +0100
@@ -0,0 +1,2 @@
+minishell> > > > >
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:07.770383727 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:07.774383792 +0100
@@ -1 +1 @@
-test_results/bash_command.sh: 1: Syntax error: redirection unexpected
+minishell: syntax error near unexpected token `newline'
Bash stdout:

Minishell stdout:
minishell> > > > >
minishell> exit

Bash stderr:
test_results/bash_command.sh: 1: Syntax error: redirection unexpected

Minishell stderr:
minishell: syntax error near unexpected token `newline'

-------------------------------------------------------------

Test 71: > > > > > > > >
Commande: > > > > > > > >
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:07.854385109 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:07.862385240 +0100
@@ -0,0 +1,2 @@
+minishell> > > > > > > > >
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:07.858385174 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:07.862385240 +0100
@@ -1 +1 @@
-test_results/bash_command.sh: 1: Syntax error: redirection unexpected
+minishell: syntax error near unexpected token `newline'
Bash stdout:

Minishell stdout:
minishell> > > > > > > > >
minishell> exit

Bash stderr:
test_results/bash_command.sh: 1: Syntax error: redirection unexpected

Minishell stderr:
minishell: syntax error near unexpected token `newline'

-------------------------------------------------------------

Test 72: > >> > > > > > > >
Commande: > >> > > > > > > >
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:07.946386621 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:07.954386753 +0100
@@ -0,0 +1,2 @@
+minishell> > >> > > > > > > >
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:07.950386687 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:07.954386753 +0100
@@ -1 +1 @@
-test_results/bash_command.sh: 1: Syntax error: redirection unexpected
+minishell: syntax error near unexpected token `newline'
Bash stdout:

Minishell stdout:
minishell> > >> > > > > > > >
minishell> exit

Bash stderr:
test_results/bash_command.sh: 1: Syntax error: redirection unexpected

Minishell stderr:
minishell: syntax error near unexpected token `newline'

-------------------------------------------------------------

Test 73: /
Commande: /
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:08.034388068 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:08.042388200 +0100
@@ -0,0 +1,2 @@
+minishell> /
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:08.038388134 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:08.042388200 +0100
@@ -1 +1 @@
-test_results/bash_command.sh: 1: /: Permission denied
+minishell: /: is a directory
Bash stdout:

Minishell stdout:
minishell> /
minishell> exit

Bash stderr:
test_results/bash_command.sh: 1: /: Permission denied

Minishell stderr:
minishell: /: is a directory

-------------------------------------------------------------

Test 74: //
Commande: //
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:08.122389515 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:08.130389647 +0100
@@ -0,0 +1,2 @@
+minishell> //
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:08.126389581 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:08.130389647 +0100
@@ -1 +1 @@
-test_results/bash_command.sh: 1: //: Permission denied
+minishell: //: is a directory
Bash stdout:

Minishell stdout:
minishell> //
minishell> exit

Bash stderr:
test_results/bash_command.sh: 1: //: Permission denied

Minishell stderr:
minishell: //: is a directory

-------------------------------------------------------------

Test 75: /.
Commande: /.
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:08.210390963 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:08.214391028 +0100
@@ -0,0 +1,2 @@
+minishell> /.
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:08.214391028 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:08.214391028 +0100
@@ -1 +1 @@
-test_results/bash_command.sh: 1: /.: Permission denied
+minishell: /.: is a directory
Bash stdout:

Minishell stdout:
minishell> /.
minishell> exit

Bash stderr:
test_results/bash_command.sh: 1: /.: Permission denied

Minishell stderr:
minishell: /.: is a directory

-------------------------------------------------------------

Test 76: /./../../../../..
Commande: /./../../../../..
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:08.298392410 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:08.302392476 +0100
@@ -0,0 +1,2 @@
+minishell> /./../../../../..
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:08.302392476 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:08.302392476 +0100
@@ -1 +1 @@
-test_results/bash_command.sh: 1: /./../../../../..: Permission denied
+minishell: /./../../../../..: is a directory
Bash stdout:

Minishell stdout:
minishell> /./../../../../..
minishell> exit

Bash stderr:
test_results/bash_command.sh: 1: /./../../../../..: Permission denied

Minishell stderr:
minishell: /./../../../../..: is a directory

-------------------------------------------------------------

Test 77: ///////
Commande: ///////
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:08.382393791 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:08.390393922 +0100
@@ -0,0 +1,2 @@
+minishell> ///////
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:08.386393857 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:08.390393922 +0100
@@ -1 +1 @@
-test_results/bash_command.sh: 1: ///////: Permission denied
+minishell: ///////: is a directory
Bash stdout:

Minishell stdout:
minishell> ///////
minishell> exit

Bash stderr:
test_results/bash_command.sh: 1: ///////: Permission denied

Minishell stderr:
minishell: ///////: is a directory

-------------------------------------------------------------

Test 78: \
Commande: \
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:08.470395238 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:08.478395370 +0100
@@ -0,0 +1,2 @@
+minishell> \\
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:08.474395304 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:08.478395370 +0100
@@ -1 +1 @@
-test_results/bash_command.sh: 1: \: not found
+minishell: \: command not found
Bash stdout:

Minishell stdout:
minishell> \\
minishell> exit

Bash stderr:
test_results/bash_command.sh: 1: \: not found

Minishell stderr:
minishell: \: command not found

-------------------------------------------------------------

Test 79: \\
Commande: \\
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:08.558396685 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:08.566396817 +0100
@@ -0,0 +1,2 @@
+minishell> \\\\
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:08.562396751 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:08.566396817 +0100
@@ -1 +1 @@
-test_results/bash_command.sh: 1: \\: not found
+minishell: \\: command not found
Bash stdout:

Minishell stdout:
minishell> \\\\
minishell> exit

Bash stderr:
test_results/bash_command.sh: 1: \\: not found

Minishell stderr:
minishell: \\: command not found

-------------------------------------------------------------

Test 80: \\\\
Commande: \\\\
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:08.646398133 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:08.650398198 +0100
@@ -0,0 +1,2 @@
+minishell> \\\\\\\\
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:08.650398198 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:08.650398198 +0100
@@ -1 +1 @@
-test_results/bash_command.sh: 1: \\\\: not found
+minishell: \\\\: command not found
Bash stdout:

Minishell stdout:
minishell> \\\\\\\\
minishell> exit

Bash stderr:
test_results/bash_command.sh: 1: \\\\: not found

Minishell stderr:
minishell: \\\\: command not found

-------------------------------------------------------------

Test 81: -
Commande: -
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:08.734399579 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:08.742399711 +0100
@@ -0,0 +1,2 @@
+minishell> -
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:08.738399646 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:08.742399711 +0100
@@ -1 +1 @@
-test_results/bash_command.sh: 1: -: not found
+minishell: -: command not found
Bash stdout:

Minishell stdout:
minishell> -
minishell> exit

Bash stderr:
test_results/bash_command.sh: 1: -: not found

Minishell stderr:
minishell: -: command not found

-------------------------------------------------------------

Test 82: > >
Commande: ><|> >|><
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:08.822401027 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:08.826401092 +0100
@@ -0,0 +1,2 @@
+minishell> ><|> >|><
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:08.826401092 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:08.826401092 +0100
@@ -1 +1 @@
-test_results/bash_command.sh: 1: Syntax error: redirection unexpected
+minishell: syntax error near unexpected token `|'
Bash stdout:

Minishell stdout:
minishell> ><|> >|><
minishell> exit

Bash stderr:
test_results/bash_command.sh: 1: Syntax error: redirection unexpected

Minishell stderr:
minishell: syntax error near unexpected token `|'

-------------------------------------------------------------

Test 83: &&
Commande: &&
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:08.910402474 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:08.918402606 +0100
@@ -0,0 +1,2 @@
+minishell> &&
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:08.918402606 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:08.918402606 +0100
@@ -1 +1 @@
-test_results/bash_command.sh: 1: Syntax error: "&&" unexpected
+minishell: syntax error near unexpected token `&&'
Bash stdout:

Minishell stdout:
minishell> &&
minishell> exit

Bash stderr:
test_results/bash_command.sh: 1: Syntax error: "&&" unexpected

Minishell stderr:
minishell: syntax error near unexpected token `&&'

-------------------------------------------------------------

Test 84: &&&&&
Commande: &&&&&
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:09.006404053 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:09.014404184 +0100
@@ -0,0 +1,2 @@
+minishell> &&&&&
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:09.010404119 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:09.014404184 +0100
@@ -1 +1 @@
-test_results/bash_command.sh: 1: Syntax error: "&&" unexpected
+minishell: syntax error near unexpected token `&&&&&'
Bash stdout:

Minishell stdout:
minishell> &&&&&
minishell> exit

Bash stderr:
test_results/bash_command.sh: 1: Syntax error: "&&" unexpected

Minishell stderr:
minishell: syntax error near unexpected token `&&&&&'

-------------------------------------------------------------

Test 85: &&&&&&&&&&&&&&
Commande: &&&&&&&&&&&&&&
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:09.098405565 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:09.102405632 +0100
@@ -0,0 +1,2 @@
+minishell> &&&&&&&&&&&&&&
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:09.102405632 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:09.102405632 +0100
@@ -1 +1 @@
-test_results/bash_command.sh: 1: Syntax error: "&&" unexpected
+minishell: syntax error near unexpected token `&&&&&&&&&&&&&&'
Bash stdout:

Minishell stdout:
minishell> &&&&&&&&&&&&&&
minishell> exit

Bash stderr:
test_results/bash_command.sh: 1: Syntax error: "&&" unexpected

Minishell stderr:
minishell: syntax error near unexpected token `&&&&&&&&&&&&&&'

-------------------------------------------------------------

Test 86: ;;
Commande: ;;
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:09.182406947 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:09.190407078 +0100
@@ -0,0 +1,2 @@
+minishell> ;;
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:09.186407013 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:09.190407078 +0100
@@ -1 +1 @@
-test_results/bash_command.sh: 1: Syntax error: ";;" unexpected
+minishell: syntax error near unexpected token `;;'
Bash stdout:

Minishell stdout:
minishell> ;;
minishell> exit

Bash stderr:
test_results/bash_command.sh: 1: Syntax error: ";;" unexpected

Minishell stderr:
minishell: syntax error near unexpected token `;;'

-------------------------------------------------------------

Test 87: ;;;;;
Commande: ;;;;;
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:09.274408460 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:09.278408526 +0100
@@ -0,0 +1,2 @@
+minishell> ;;;;;
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:09.274408460 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:09.278408526 +0100
@@ -1 +1 @@
-test_results/bash_command.sh: 1: Syntax error: ";;" unexpected
+minishell: syntax error near unexpected token `;;;;;'
Bash stdout:

Minishell stdout:
minishell> ;;;;;
minishell> exit

Bash stderr:
test_results/bash_command.sh: 1: Syntax error: ";;" unexpected

Minishell stderr:
minishell: syntax error near unexpected token `;;;;;'

-------------------------------------------------------------

Test 88: ;;;;;;;;;;;;;;;
Commande: ;;;;;;;;;;;;;;;
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:09.358409841 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:09.366409972 +0100
@@ -0,0 +1,2 @@
+minishell> ;;;;;;;;;;;;;;;
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:09.362409907 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:09.366409972 +0100
@@ -1 +1 @@
-test_results/bash_command.sh: 1: Syntax error: ";;" unexpected
+minishell: syntax error near unexpected token `;;;;;;;;;;;;;;;'
Bash stdout:

Minishell stdout:
minishell> ;;;;;;;;;;;;;;;
minishell> exit

Bash stderr:
test_results/bash_command.sh: 1: Syntax error: ";;" unexpected

Minishell stderr:
minishell: syntax error near unexpected token `;;;;;;;;;;;;;;;'

-------------------------------------------------------------

Test 89: ()
Commande: ()
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:09.446411289 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:09.450411354 +0100
@@ -0,0 +1,2 @@
+minishell> ()
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:09.450411354 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:09.450411354 +0100
@@ -1 +1 @@
-test_results/bash_command.sh: 1: Syntax error: ")" unexpected
+minishell: (): command not found
Bash stdout:

Minishell stdout:
minishell> ()
minishell> exit

Bash stderr:
test_results/bash_command.sh: 1: Syntax error: ")" unexpected

Minishell stderr:
minishell: (): command not found

-------------------------------------------------------------

Test 90: ( ( ) )
Commande: ( ( ) )
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:09.530412670 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:09.538412801 +0100
@@ -0,0 +1,2 @@
+minishell> ( ( ) )
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:09.534412735 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:09.538412801 +0100
@@ -1 +1 @@
-test_results/bash_command.sh: 1: Syntax error: ")" unexpected
+minishell: (: command not found
Bash stdout:

Minishell stdout:
minishell> ( ( ) )
minishell> exit

Bash stderr:
test_results/bash_command.sh: 1: Syntax error: ")" unexpected

Minishell stderr:
minishell: (: command not found

-------------------------------------------------------------

Test 91: ( ( ( ( ) ) ) )
Commande: ( ( ( ( ) ) ) )
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:09.618414117 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:09.626414248 +0100
@@ -0,0 +1,2 @@
+minishell> ( ( ( ( ) ) ) )
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:09.622414183 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:09.626414248 +0100
@@ -1 +1 @@
-test_results/bash_command.sh: 1: Syntax error: ")" unexpected
+minishell: (: command not found
Bash stdout:

Minishell stdout:
minishell> ( ( ( ( ) ) ) )
minishell> exit

Bash stderr:
test_results/bash_command.sh: 1: Syntax error: ")" unexpected

Minishell stderr:
minishell: (: command not found

-------------------------------------------------------------

Test 92: ""
Commande: ""
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:09.706415564 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:09.714415696 +0100
@@ -0,0 +1,2 @@
+minishell> ""
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:09.710415629 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:09.710415629 +0100
@@ -1 +0,0 @@
-test_results/bash_command.sh: 1: : Permission denied
Bash stdout:

Minishell stdout:
minishell> ""
minishell> exit

Bash stderr:
test_results/bash_command.sh: 1: : Permission denied

Minishell stderr:

-------------------------------------------------------------

Test 93: "hola"
Commande: "hola"
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:09.794417011 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:09.802417143 +0100
@@ -0,0 +1,2 @@
+minishell> "hola"
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:09.798417077 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:09.802417143 +0100
@@ -1 +1 @@
-test_results/bash_command.sh: 1: hola: not found
+minishell: hola: command not found
Bash stdout:

Minishell stdout:
minishell> "hola"
minishell> exit

Bash stderr:
test_results/bash_command.sh: 1: hola: not found

Minishell stderr:
minishell: hola: command not found

-------------------------------------------------------------

Test 94: 'hola'
Commande: 'hola'
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:09.882418458 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:09.886418524 +0100
@@ -0,0 +1,2 @@
+minishell> 'hola'
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:09.886418524 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:09.886418524 +0100
@@ -1 +1 @@
-test_results/bash_command.sh: 1: hola: not found
+minishell: hola: command not found
Bash stdout:

Minishell stdout:
minishell> 'hola'
minishell> exit

Bash stderr:
test_results/bash_command.sh: 1: hola: not found

Minishell stderr:
minishell: hola: command not found

-------------------------------------------------------------

Test 95: ''
Commande: ''
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:09.966419840 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:09.974419971 +0100
@@ -0,0 +1,2 @@
+minishell> ''
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:09.974419971 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:09.974419971 +0100
@@ -1 +0,0 @@
-test_results/bash_command.sh: 1: : Permission denied
Bash stdout:

Minishell stdout:
minishell> ''
minishell> exit

Bash stderr:
test_results/bash_command.sh: 1: : Permission denied

Minishell stderr:

-------------------------------------------------------------

Test 96: *
Commande: *
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:10.054421286 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:10.062421418 +0100
@@ -0,0 +1,2 @@
+minishell> *
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:10.058421353 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:10.062421418 +0100
@@ -1 +1 @@
-test_results/bash_command.sh: 1: CHANGELOG.md: not found
+minishell: *: command not found
Bash stdout:

Minishell stdout:
minishell> *
minishell> exit

Bash stderr:
test_results/bash_command.sh: 1: CHANGELOG.md: not found

Minishell stderr:
minishell: *: command not found

-------------------------------------------------------------

Test 97: */*
Commande: */*
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:10.142422734 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:10.150422865 +0100
@@ -0,0 +1,2 @@
+minishell> */*
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:10.146422800 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:10.150422865 +0100
@@ -1 +1 @@
-test_results/bash_command.sh: 1: includes/header.h: Permission denied
+minishell: */*: No such file or directory
Bash stdout:

Minishell stdout:
minishell> */*
minishell> exit

Bash stderr:
test_results/bash_command.sh: 1: includes/header.h: Permission denied

Minishell stderr:
minishell: */*: No such file or directory

-------------------------------------------------------------

Test 98: */*
Commande: */*
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:10.230424181 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:10.234424247 +0100
@@ -0,0 +1,2 @@
+minishell> */*
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:10.234424247 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:10.234424247 +0100
@@ -1 +1 @@
-test_results/bash_command.sh: 1: includes/header.h: Permission denied
+minishell: */*: No such file or directory
Bash stdout:

Minishell stdout:
minishell> */*
minishell> exit

Bash stderr:
test_results/bash_command.sh: 1: includes/header.h: Permission denied

Minishell stderr:
minishell: */*: No such file or directory

-------------------------------------------------------------

Test 99: .
Commande: .
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:10.314425562 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:10.322425694 +0100
@@ -0,0 +1,2 @@
+minishell> .
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:10.314425562 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:10.322425694 +0100
@@ -0,0 +1 @@
+minishell: /tmp/.mount_Cursorltm7aq/usr/bin//.: is a directory
Bash stdout:

Minishell stdout:
minishell> .
minishell> exit

Bash stderr:

Minishell stderr:
minishell: /tmp/.mount_Cursorltm7aq/usr/bin//.: is a directory

-------------------------------------------------------------

Test 100: ..
Commande: ..
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:10.402427010 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:10.410427141 +0100
@@ -0,0 +1,2 @@
+minishell> ..
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:10.406427075 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:10.410427141 +0100
@@ -1 +1 @@
-test_results/bash_command.sh: 1: ..: Permission denied
+minishell: /tmp/.mount_Cursorltm7aq/usr/bin//..: is a directory
Bash stdout:

Minishell stdout:
minishell> ..
minishell> exit

Bash stderr:
test_results/bash_command.sh: 1: ..: Permission denied

Minishell stderr:
minishell: /tmp/.mount_Cursorltm7aq/usr/bin//..: is a directory

-------------------------------------------------------------

Test 101: ~
Commande: ~
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:10.490428457 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:10.498428589 +0100
@@ -0,0 +1,2 @@
+minishell> ~
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:10.494428522 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:10.498428589 +0100
@@ -1 +1 @@
-test_results/bash_command.sh: 1: /home/yboumanz: Permission denied
+minishell: ~: command not found
Bash stdout:

Minishell stdout:
minishell> ~
minishell> exit

Bash stderr:
test_results/bash_command.sh: 1: /home/yboumanz: Permission denied

Minishell stderr:
minishell: ~: command not found

-------------------------------------------------------------

Test 102: ABC=hola
Commande: ABC=hola
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:10.578429904 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:10.586430035 +0100
@@ -0,0 +1,2 @@
+minishell> ABC=hola
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:10.578429904 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:10.586430035 +0100
@@ -0,0 +1 @@
+minishell: ABC=hola: command not found
Bash stdout:

Minishell stdout:
minishell> ABC=hola
minishell> exit

Bash stderr:

Minishell stderr:
minishell: ABC=hola: command not found

-------------------------------------------------------------

Test 103: 4ABC=hola
Commande: 4ABC=hola
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:10.670431417 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:10.674431483 +0100
@@ -0,0 +1,2 @@
+minishell> 4ABC=hola
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:10.674431483 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:10.674431483 +0100
@@ -1 +1 @@
-test_results/bash_command.sh: 1: 4ABC=hola: not found
+minishell: 4ABC=hola: command not found
Bash stdout:

Minishell stdout:
minishell> 4ABC=hola
minishell> exit

Bash stderr:
test_results/bash_command.sh: 1: 4ABC=hola: not found

Minishell stderr:
minishell: 4ABC=hola: command not found

-------------------------------------------------------------

Test 104: hola
Commande: hola
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:10.758432864 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:10.766432996 +0100
@@ -0,0 +1,2 @@
+minishell> hola
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:10.762432929 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:10.766432996 +0100
@@ -1 +1 @@
-test_results/bash_command.sh: 1: hola: not found
+minishell: hola: command not found
Bash stdout:

Minishell stdout:
minishell> hola
minishell> exit

Bash stderr:
test_results/bash_command.sh: 1: hola: not found

Minishell stderr:
minishell: hola: command not found

-------------------------------------------------------------

Test 105: hola que tal
Commande: hola que tal
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:10.846434311 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:10.850434377 +0100
@@ -0,0 +1,2 @@
+minishell> hola que tal
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:10.846434311 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:10.850434377 +0100
@@ -1 +1 @@
-test_results/bash_command.sh: 1: hola: not found
+minishell: hola: command not found
Bash stdout:

Minishell stdout:
minishell> hola que tal
minishell> exit

Bash stderr:
test_results/bash_command.sh: 1: hola: not found

Minishell stderr:
minishell: hola: command not found

-------------------------------------------------------------

Test 106: Makefile
Commande: Makefile
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:10.930435692 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:10.938435824 +0100
@@ -0,0 +1,2 @@
+minishell> Makefile
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:10.934435758 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:10.938435824 +0100
@@ -1 +1 @@
-test_results/bash_command.sh: 1: Makefile: not found
+minishell: Makefile: command not found
Bash stdout:

Minishell stdout:
minishell> Makefile
minishell> exit

Bash stderr:
test_results/bash_command.sh: 1: Makefile: not found

Minishell stderr:
minishell: Makefile: command not found

-------------------------------------------------------------

Test 107: echo > <
Commande: echo > <
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:11.018437140 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:11.026437271 +0100
@@ -0,0 +1,2 @@
+minishell> echo > <
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:11.022437205 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:11.026437271 +0100
@@ -1 +1 @@
-test_results/bash_command.sh: 1: Syntax error: redirection unexpected
+minishell: syntax error near unexpected token `newline'
Bash stdout:

Minishell stdout:
minishell> echo > <
minishell> exit

Bash stderr:
test_results/bash_command.sh: 1: Syntax error: redirection unexpected

Minishell stderr:
minishell: syntax error near unexpected token `newline'

-------------------------------------------------------------

Test 108: >echo>
Commande: >echo>
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:11.106438586 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:11.110438653 +0100
@@ -0,0 +1,2 @@
+minishell> >echo>
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:11.110438653 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:11.110438653 +0100
@@ -1 +1 @@
-test_results/bash_command.sh: 2: Syntax error: newline unexpected
+minishell: syntax error near unexpected token `newline'
Bash stdout:

Minishell stdout:
minishell> >echo>
minishell> exit

Bash stderr:
test_results/bash_command.sh: 2: Syntax error: newline unexpected

Minishell stderr:
minishell: syntax error near unexpected token `newline'

-------------------------------------------------------------

Test 109: <echo<
Commande: <echo<
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:11.198440100 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:11.202440165 +0100
@@ -0,0 +1,2 @@
+minishell> <echo<
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:11.202440165 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:11.202440165 +0100
@@ -1 +1 @@
-test_results/bash_command.sh: 2: Syntax error: newline unexpected
+minishell: syntax error near unexpected token `newline'
Bash stdout:

Minishell stdout:
minishell> <echo<
minishell> exit

Bash stderr:
test_results/bash_command.sh: 2: Syntax error: newline unexpected

Minishell stderr:
minishell: syntax error near unexpected token `newline'

-------------------------------------------------------------

Test 110: > >echo> >
Commande: > >echo> >
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:11.290441613 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:11.298441744 +0100
@@ -0,0 +1,2 @@
+minishell> > >echo> >
+minishell> exit
Différences dans la sortie d'erreur:
--- test_results/bash_error.txt	2025-03-14 10:23:11.294441678 +0100
+++ test_results/minishell_error.txt	2025-03-14 10:23:11.298441744 +0100
@@ -1 +1 @@
-test_results/bash_command.sh: 1: Syntax error: redirection unexpected
+minishell: syntax error near unexpected token `newline'
Bash stdout:

Minishell stdout:
minishell> > >echo> >
minishell> exit

Bash stderr:
test_results/bash_command.sh: 1: Syntax error: redirection unexpected

Minishell stderr:
minishell: syntax error near unexpected token `newline'

-------------------------------------------------------------

Test 111: whoami 
Commande:  grep $USER > /tmp/bonjour|whoami | grep $USER > /tmp/bonjour
Détails des fuites:

Différences dans la sortie standard:
--- test_results/bash_output.txt	2025-03-14 10:23:11.382443126 +0100
+++ test_results/minishell_output.txt	2025-03-14 10:23:11.398443389 +0100
@@ -0,0 +1,2 @@
+minishell>  grep $USER > /tmp/bonjour|whoami | grep $USER > /tmp/bonjour
+minishell> exit
Bash stdout:

Minishell stdout:
minishell>  grep $USER > /tmp/bonjour|whoami | grep $USER > /tmp/bonjour
minishell> exit

Bash stderr:

Minishell stderr:

-------------------------------------------------------------


============================================================
RÉSUMÉ DES TESTS
============================================================

